SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_frc.h
  __IM uint32_t          PKTBUF9_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF10_CLR;          /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF11_CLR;          /**< Packet Capture Data Buffer                         */
  FRC_FCD_TypeDef        FCD_CLR[4U];           /**< Frame Descriptors                                  */
  uint32_t               RESERVED13[10U];       /**< Reserved for future use                            */
  FRC_INTELEMENT_TypeDef INTELEMENT_CLR[16U];   /**< Interleaver element                                */
  __IOM uint32_t         AHBCONFIG_CLR;         /**< AHB Configuration                                  */
  uint32_t               RESERVED14[927U];      /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_TGL;         /**< IP Version                                         */
  __IOM uint32_t         EN_TGL;                /**< Enable peripheral clock to this module             */
  __IM uint32_t          STATUS_TGL;            /**< FRC Status                                         */
  __IOM uint32_t         DFLCTRL_TGL;           /**< Dynamic Frame Length Control                       */
  __IOM uint32_t         MAXLENGTH_TGL;         /**< Maximum Frame Length Register                      */
  __IOM uint32_t         ADDRFILTCTRL_TGL;      /**< Address Filter Control                             */
  __IOM uint32_t         DATABUFFER_TGL;        /**< Frame controller data buffer                       */
  __IM uint32_t          WCNT_TGL;              /**< Word Counter Value Register                        */
  __IOM uint32_t         WCNTCMP0_TGL;          /**< Word Counter Compare 0                             */
  __IOM uint32_t         WCNTCMP1_TGL;          /**< Word Counter Compare 1                             */
  __IOM uint32_t         WCNTCMP2_TGL;          /**< Word Counter Compare 2                             */
  __IOM uint32_t         CMD_TGL;               /**< FRC Commands                                       */
  __IOM uint32_t         WHITECTRL_TGL;         /**< Whitener Control                                   */
  __IOM uint32_t         WHITEPOLY_TGL;         /**< Whitener Polynomial                                */
  __IOM uint32_t         WHITEINIT_TGL;         /**< Whitener Initial Value                             */
  __IOM uint32_t         FECCTRL_TGL;           /**< Forward Error Correction Control                   */
  __IOM uint32_t         BLOCKRAMADDR_TGL;      /**< Block decoding RAM address register                */
  __IOM uint32_t         CONVRAMADDR_TGL;       /**< Convolutional decoding RAM address                 */
  __IOM uint32_t         CTRL_TGL;              /**< Control Register                                   */
  __IOM uint32_t         RXCTRL_TGL;            /**< RX Control Register                                */
  __IOM uint32_t         TRAILTXDATACTRL_TGL;   /**< Trailing TX Data Control                           */
  __IOM uint32_t         TRAILRXDATA_TGL;       /**< Trailing RX Data                                   */
  __IM uint32_t          SCNT_TGL;              /**< Sub-Frame Counter Value Register                   */
  __IOM uint32_t         CONVGENERATOR_TGL;     /**< Convolutional Coder Polynomials                    */
  __IOM uint32_t         PUNCTCTRL_TGL;         /**< Puncturing Control                                 */
  __IOM uint32_t         PAUSECTRL_TGL;         /**< Pause Control                                      */
  __IOM uint32_t         IF_TGL;                /**< Frame Controller Interrupt Flags                   */
  __IOM uint32_t         IEN_TGL;               /**< Interrupt Enable Register                          */
  __IM uint32_t          OTACNT_TGL;            /**< Over the air number of bits counter                */
  uint32_t               RESERVED15[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         BUFFERMODE_TGL;        /**< FRC Buffer Control                                 */
  uint32_t               RESERVED16[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         SNIFFCTRL_TGL;         /**< FRC Sniffer Control Register                       */
  __IOM uint32_t         AUXDATA_TGL;           /**< Auxiliary sniffer data output register             */
  __IOM uint32_t         RAWCTRL_TGL;           /**< Raw data control                                   */
  __IM uint32_t          RXRAWDATA_TGL;         /**< Receiver RAW data                                  */
  __IM uint32_t          PAUSEDATA_TGL;         /**< Receiver pause data                                */
  __IM uint32_t          LIKELYCONVSTATE_TGL;   /**< Most likely convolutional decoder state            */
  __IM uint32_t          INTELEMENTNEXT_TGL;    /**< Interleaver element value                          */
  __IOM uint32_t         INTWRITEPOINT_TGL;     /**< Interleaver write pointer                          */
  __IOM uint32_t         INTREADPOINT_TGL;      /**< Interleaver read pointer                           */
  __IOM uint32_t         AUTOCG_TGL;            /**< Automatic clock gating                             */
  __IOM uint32_t         CGCLKSTOP_TGL;         /**< Automatic clock gating                             */
  uint32_t               RESERVED17[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         SEQIF_TGL;             /**< SEQ Frame Controller Interrupt Flags               */
  __IOM uint32_t         SEQIEN_TGL;            /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t         WCNTCMP3_TGL;          /**< Word Counter Compare 3                             */
  __IOM uint32_t         BOICTRL_TGL;           /**< Bit of Interest Control                            */
  __IOM uint32_t         DSLCTRL_TGL;           /**< Dynamic Supp Length Control                        */
  __IOM uint32_t         WCNTCMP4_TGL;          /**< Word Counter Compare 4                             */
  __IOM uint32_t         WCNTCMP5_TGL;          /**< Word Counter Compare 5                             */
  __IOM uint32_t         PKTBUFCTRL_TGL;        /**< Packet Capture Buffer Ctrl                         */
  __IM uint32_t          PKTBUFSTATUS_TGL;      /**< Packet Capture Buffer Status                       */
  __IM uint32_t          PKTBUF0_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF1_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF2_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF3_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF4_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF5_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF6_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF7_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF8_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF9_TGL;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF10_TGL;          /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF11_TGL;          /**< Packet Capture Data Buffer                         */
  FRC_FCD_TypeDef        FCD_TGL[4U];           /**< Frame Descriptors                                  */
  uint32_t               RESERVED18[10U];       /**< Reserved for future use                            */
  FRC_INTELEMENT_TypeDef INTELEMENT_TGL[16U];   /**< Interleaver element                                */
  __IOM uint32_t         AHBCONFIG_TGL;         /**< AHB Configuration                                  */
} FRC_TypeDef;
