SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_frc.h
/** @} End of group BGM24_FRC */

/**************************************************************************//**
 * @addtogroup BGM24_FRC
 * @{
 * @defgroup BGM24_FRC_BitFields FRC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for FRC IPVERSION */
#define _FRC_IPVERSION_RESETVALUE                          0x00000003UL                            /**< Default value for FRC_IPVERSION             */
#define _FRC_IPVERSION_MASK                                0xFFFFFFFFUL                            /**< Mask for FRC_IPVERSION                      */
#define _FRC_IPVERSION_IPVERSION_SHIFT                     0                                       /**< Shift value for FRC_IPVERSION               */
#define _FRC_IPVERSION_IPVERSION_MASK                      0xFFFFFFFFUL                            /**< Bit mask for FRC_IPVERSION                  */
#define _FRC_IPVERSION_IPVERSION_DEFAULT                   0x00000003UL                            /**< Mode DEFAULT for FRC_IPVERSION              */
#define FRC_IPVERSION_IPVERSION_DEFAULT                    (_FRC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_IPVERSION      */

/* Bit fields for FRC EN */
#define _FRC_EN_RESETVALUE                                 0x00000000UL                 /**< Default value for FRC_EN                    */
#define _FRC_EN_MASK                                       0x00000001UL                 /**< Mask for FRC_EN                             */
#define FRC_EN_EN                                          (0x1UL << 0)                 /**< Enable peripheral clock to this module      */
#define _FRC_EN_EN_SHIFT                                   0                            /**< Shift value for FRC_EN                      */
#define _FRC_EN_EN_MASK                                    0x1UL                        /**< Bit mask for FRC_EN                         */
#define _FRC_EN_EN_DEFAULT                                 0x00000000UL                 /**< Mode DEFAULT for FRC_EN                     */
#define FRC_EN_EN_DEFAULT                                  (_FRC_EN_EN_DEFAULT << 0)    /**< Shifted mode DEFAULT for FRC_EN             */

/* Bit fields for FRC STATUS */
#define _FRC_STATUS_RESETVALUE                             0x00000000UL                                      /**< Default value for FRC_STATUS                */
#define _FRC_STATUS_MASK                                   0x07FFFFFFUL                                      /**< Mask for FRC_STATUS                         */
#define _FRC_STATUS_SNIFFDCOUNT_SHIFT                      0                                                 /**< Shift value for FRC_SNIFFDCOUNT             */
#define _FRC_STATUS_SNIFFDCOUNT_MASK                       0x1FUL                                            /**< Bit mask for FRC_SNIFFDCOUNT                */
#define _FRC_STATUS_SNIFFDCOUNT_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_SNIFFDCOUNT_DEFAULT                     (_FRC_STATUS_SNIFFDCOUNT_DEFAULT << 0)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_ACTIVETXFCD                             (0x1UL << 5)                                      /**< Active Transmit Frame Descriptor            */
#define _FRC_STATUS_ACTIVETXFCD_SHIFT                      5                                                 /**< Shift value for FRC_ACTIVETXFCD             */
#define _FRC_STATUS_ACTIVETXFCD_MASK                       0x20UL                                            /**< Bit mask for FRC_ACTIVETXFCD                */
#define _FRC_STATUS_ACTIVETXFCD_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define _FRC_STATUS_ACTIVETXFCD_FCD0                       0x00000000UL                                      /**< Mode FCD0 for FRC_STATUS                    */
#define _FRC_STATUS_ACTIVETXFCD_FCD1                       0x00000001UL                                      /**< Mode FCD1 for FRC_STATUS                    */
#define FRC_STATUS_ACTIVETXFCD_DEFAULT                     (_FRC_STATUS_ACTIVETXFCD_DEFAULT << 5)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_ACTIVETXFCD_FCD0                        (_FRC_STATUS_ACTIVETXFCD_FCD0 << 5)               /**< Shifted mode FCD0 for FRC_STATUS            */
#define FRC_STATUS_ACTIVETXFCD_FCD1                        (_FRC_STATUS_ACTIVETXFCD_FCD1 << 5)               /**< Shifted mode FCD1 for FRC_STATUS            */
#define FRC_STATUS_ACTIVERXFCD                             (0x1UL << 6)                                      /**< Active Receive Frame Descriptor             */
#define _FRC_STATUS_ACTIVERXFCD_SHIFT                      6                                                 /**< Shift value for FRC_ACTIVERXFCD             */
#define _FRC_STATUS_ACTIVERXFCD_MASK                       0x40UL                                            /**< Bit mask for FRC_ACTIVERXFCD                */
#define _FRC_STATUS_ACTIVERXFCD_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define _FRC_STATUS_ACTIVERXFCD_FCD2                       0x00000000UL                                      /**< Mode FCD2 for FRC_STATUS                    */
#define _FRC_STATUS_ACTIVERXFCD_FCD3                       0x00000001UL                                      /**< Mode FCD3 for FRC_STATUS                    */
#define FRC_STATUS_ACTIVERXFCD_DEFAULT                     (_FRC_STATUS_ACTIVERXFCD_DEFAULT << 6)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_ACTIVERXFCD_FCD2                        (_FRC_STATUS_ACTIVERXFCD_FCD2 << 6)               /**< Shifted mode FCD2 for FRC_STATUS            */
#define FRC_STATUS_ACTIVERXFCD_FCD3                        (_FRC_STATUS_ACTIVERXFCD_FCD3 << 6)               /**< Shifted mode FCD3 for FRC_STATUS            */
#define FRC_STATUS_SNIFFDFRAME                             (0x1UL << 7)                                      /**< Sniffer data frame active status            */
#define _FRC_STATUS_SNIFFDFRAME_SHIFT                      7                                                 /**< Shift value for FRC_SNIFFDFRAME             */
#define _FRC_STATUS_SNIFFDFRAME_MASK                       0x80UL                                            /**< Bit mask for FRC_SNIFFDFRAME                */
#define _FRC_STATUS_SNIFFDFRAME_DEFAULT                    0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_SNIFFDFRAME_DEFAULT                     (_FRC_STATUS_SNIFFDFRAME_DEFAULT << 7)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_RXRAWBLOCKED                            (0x1UL << 8)                                      /**< Receiver raw trigger block is active        */
#define _FRC_STATUS_RXRAWBLOCKED_SHIFT                     8                                                 /**< Shift value for FRC_RXRAWBLOCKED            */
#define _FRC_STATUS_RXRAWBLOCKED_MASK                      0x100UL                                           /**< Bit mask for FRC_RXRAWBLOCKED               */
#define _FRC_STATUS_RXRAWBLOCKED_DEFAULT                   0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_RXRAWBLOCKED_DEFAULT                    (_FRC_STATUS_RXRAWBLOCKED_DEFAULT << 8)           /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_FRAMEOK                                 (0x1UL << 9)                                      /**< Frame valid                                 */
#define _FRC_STATUS_FRAMEOK_SHIFT                          9                                                 /**< Shift value for FRC_FRAMEOK                 */
#define _FRC_STATUS_FRAMEOK_MASK                           0x200UL                                           /**< Bit mask for FRC_FRAMEOK                    */
#define _FRC_STATUS_FRAMEOK_DEFAULT                        0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_FRAMEOK_DEFAULT                         (_FRC_STATUS_FRAMEOK_DEFAULT << 9)                /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_RXABORTINPROGRESS                       (0x1UL << 10)                                     /**< Receive aborted in progress status flag     */
#define _FRC_STATUS_RXABORTINPROGRESS_SHIFT                10                                                /**< Shift value for FRC_RXABORTINPROGRESS       */
#define _FRC_STATUS_RXABORTINPROGRESS_MASK                 0x400UL                                           /**< Bit mask for FRC_RXABORTINPROGRESS          */
#define _FRC_STATUS_RXABORTINPROGRESS_DEFAULT              0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_RXABORTINPROGRESS_DEFAULT               (_FRC_STATUS_RXABORTINPROGRESS_DEFAULT << 10)     /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_TXWORD                                  (0x1UL << 11)                                     /**< Transmit Word Flag                          */
#define _FRC_STATUS_TXWORD_SHIFT                           11                                                /**< Shift value for FRC_TXWORD                  */
#define _FRC_STATUS_TXWORD_MASK                            0x800UL                                           /**< Bit mask for FRC_TXWORD                     */
#define _FRC_STATUS_TXWORD_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_TXWORD_DEFAULT                          (_FRC_STATUS_TXWORD_DEFAULT << 11)                /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_RXWORD                                  (0x1UL << 12)                                     /**< Receive Word Flag                           */
#define _FRC_STATUS_RXWORD_SHIFT                           12                                                /**< Shift value for FRC_RXWORD                  */
#define _FRC_STATUS_RXWORD_MASK                            0x1000UL                                          /**< Bit mask for FRC_RXWORD                     */
#define _FRC_STATUS_RXWORD_DEFAULT                         0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_RXWORD_DEFAULT                          (_FRC_STATUS_RXWORD_DEFAULT << 12)                /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_CONVPAUSED                              (0x1UL << 13)                                     /**< Convolutional coder pause event active      */
#define _FRC_STATUS_CONVPAUSED_SHIFT                       13                                                /**< Shift value for FRC_CONVPAUSED              */
#define _FRC_STATUS_CONVPAUSED_MASK                        0x2000UL                                          /**< Bit mask for FRC_CONVPAUSED                 */
#define _FRC_STATUS_CONVPAUSED_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_CONVPAUSED_DEFAULT                      (_FRC_STATUS_CONVPAUSED_DEFAULT << 13)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_TXSUBFRAMEPAUSED                        (0x1UL << 14)                                     /**< Transmit subframe pause event active        */
#define _FRC_STATUS_TXSUBFRAMEPAUSED_SHIFT                 14                                                /**< Shift value for FRC_TXSUBFRAMEPAUSED        */
#define _FRC_STATUS_TXSUBFRAMEPAUSED_MASK                  0x4000UL                                          /**< Bit mask for FRC_TXSUBFRAMEPAUSED           */
#define _FRC_STATUS_TXSUBFRAMEPAUSED_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_TXSUBFRAMEPAUSED_DEFAULT                (_FRC_STATUS_TXSUBFRAMEPAUSED_DEFAULT << 14)      /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_INTERLEAVEREADPAUSED                    (0x1UL << 15)                                     /**< Interleaver read pause event active         */
#define _FRC_STATUS_INTERLEAVEREADPAUSED_SHIFT             15                                                /**< Shift value for FRC_INTERLEAVEREADPAUSED    */
#define _FRC_STATUS_INTERLEAVEREADPAUSED_MASK              0x8000UL                                          /**< Bit mask for FRC_INTERLEAVEREADPAUSED       */
#define _FRC_STATUS_INTERLEAVEREADPAUSED_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_INTERLEAVEREADPAUSED_DEFAULT            (_FRC_STATUS_INTERLEAVEREADPAUSED_DEFAULT << 15)  /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_INTERLEAVEWRITEPAUSED                   (0x1UL << 16)                                     /**< Interleaver write pause event active        */
#define _FRC_STATUS_INTERLEAVEWRITEPAUSED_SHIFT            16                                                /**< Shift value for FRC_INTERLEAVEWRITEPAUSED   */
#define _FRC_STATUS_INTERLEAVEWRITEPAUSED_MASK             0x10000UL                                         /**< Bit mask for FRC_INTERLEAVEWRITEPAUSED      */
#define _FRC_STATUS_INTERLEAVEWRITEPAUSED_DEFAULT          0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_INTERLEAVEWRITEPAUSED_DEFAULT           (_FRC_STATUS_INTERLEAVEWRITEPAUSED_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_FRAMEDETPAUSED                          (0x1UL << 17)                                     /**< Frame detected pause event active           */
#define _FRC_STATUS_FRAMEDETPAUSED_SHIFT                   17                                                /**< Shift value for FRC_FRAMEDETPAUSED          */
#define _FRC_STATUS_FRAMEDETPAUSED_MASK                    0x20000UL                                         /**< Bit mask for FRC_FRAMEDETPAUSED             */
#define _FRC_STATUS_FRAMEDETPAUSED_DEFAULT                 0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_FRAMEDETPAUSED_DEFAULT                  (_FRC_STATUS_FRAMEDETPAUSED_DEFAULT << 17)        /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_FRAMELENGTHERROR                        (0x1UL << 18)                                     /**< Frame Length Error for RX and TX            */
#define _FRC_STATUS_FRAMELENGTHERROR_SHIFT                 18                                                /**< Shift value for FRC_FRAMELENGTHERROR        */
#define _FRC_STATUS_FRAMELENGTHERROR_MASK                  0x40000UL                                         /**< Bit mask for FRC_FRAMELENGTHERROR           */
#define _FRC_STATUS_FRAMELENGTHERROR_DEFAULT               0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_FRAMELENGTHERROR_DEFAULT                (_FRC_STATUS_FRAMELENGTHERROR_DEFAULT << 18)      /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_DEMODERROR                              (0x1UL << 19)                                     /**< Demod Error in RX                           */
#define _FRC_STATUS_DEMODERROR_SHIFT                       19                                                /**< Shift value for FRC_DEMODERROR              */
#define _FRC_STATUS_DEMODERROR_MASK                        0x80000UL                                         /**< Bit mask for FRC_DEMODERROR                 */
#define _FRC_STATUS_DEMODERROR_DEFAULT                     0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define FRC_STATUS_DEMODERROR_DEFAULT                      (_FRC_STATUS_DEMODERROR_DEFAULT << 19)            /**< Shifted mode DEFAULT for FRC_STATUS         */
#define _FRC_STATUS_FSMSTATE_SHIFT                         20                                                /**< Shift value for FRC_FSMSTATE                */
#define _FRC_STATUS_FSMSTATE_MASK                          0x1F00000UL                                       /**< Bit mask for FRC_FSMSTATE                   */
#define _FRC_STATUS_FSMSTATE_DEFAULT                       0x00000000UL                                      /**< Mode DEFAULT for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_IDLE                          0x00000000UL                                      /**< Mode IDLE for FRC_STATUS                    */
#define _FRC_STATUS_FSMSTATE_RX_INIT                       0x00000001UL                                      /**< Mode RX_INIT for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_RX_DATA                       0x00000002UL                                      /**< Mode RX_DATA for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_RX_CRC                        0x00000003UL                                      /**< Mode RX_CRC for FRC_STATUS                  */
#define _FRC_STATUS_FSMSTATE_RX_FCD_UPDATE                 0x00000004UL                                      /**< Mode RX_FCD_UPDATE for FRC_STATUS           */
#define _FRC_STATUS_FSMSTATE_RX_DISCARD                    0x00000005UL                                      /**< Mode RX_DISCARD for FRC_STATUS              */
#define _FRC_STATUS_FSMSTATE_RX_TRAIL                      0x00000006UL                                      /**< Mode RX_TRAIL for FRC_STATUS                */
#define _FRC_STATUS_FSMSTATE_RX_DONE                       0x00000007UL                                      /**< Mode RX_DONE for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_RX_PAUSE_INIT                 0x00000008UL                                      /**< Mode RX_PAUSE_INIT for FRC_STATUS           */
#define _FRC_STATUS_FSMSTATE_RX_PAUSED                     0x00000009UL                                      /**< Mode RX_PAUSED for FRC_STATUS               */
#define _FRC_STATUS_FSMSTATE_UNDEFINED1                    0x0000000AUL                                      /**< Mode UNDEFINED1 for FRC_STATUS              */
#define _FRC_STATUS_FSMSTATE_UNDEFINED2                    0x0000000BUL                                      /**< Mode UNDEFINED2 for FRC_STATUS              */
#define _FRC_STATUS_FSMSTATE_RX_CRC_ZEROCHECK              0x0000000CUL                                      /**< Mode RX_CRC_ZEROCHECK for FRC_STATUS        */
#define _FRC_STATUS_FSMSTATE_RX_SUP                        0x0000000DUL                                      /**< Mode RX_SUP for FRC_STATUS                  */
#define _FRC_STATUS_FSMSTATE_RX_WAITEOF                    0x0000000EUL                                      /**< Mode RX_WAITEOF for FRC_STATUS              */
#define _FRC_STATUS_FSMSTATE_UNDEFINED3                    0x0000000FUL                                      /**< Mode UNDEFINED3 for FRC_STATUS              */
#define _FRC_STATUS_FSMSTATE_TX_INIT                       0x00000010UL                                      /**< Mode TX_INIT for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_TX_DATA                       0x00000011UL                                      /**< Mode TX_DATA for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_TX_CRC                        0x00000012UL                                      /**< Mode TX_CRC for FRC_STATUS                  */
#define _FRC_STATUS_FSMSTATE_TX_FCD_UPDATE                 0x00000013UL                                      /**< Mode TX_FCD_UPDATE for FRC_STATUS           */
#define _FRC_STATUS_FSMSTATE_TX_TRAIL                      0x00000014UL                                      /**< Mode TX_TRAIL for FRC_STATUS                */
#define _FRC_STATUS_FSMSTATE_TX_FLUSH                      0x00000015UL                                      /**< Mode TX_FLUSH for FRC_STATUS                */
#define _FRC_STATUS_FSMSTATE_TX_DONE                       0x00000016UL                                      /**< Mode TX_DONE for FRC_STATUS                 */
#define _FRC_STATUS_FSMSTATE_TX_DONE_WAIT                  0x00000017UL                                      /**< Mode TX_DONE_WAIT for FRC_STATUS            */
#define _FRC_STATUS_FSMSTATE_TX_RAW                        0x00000018UL                                      /**< Mode TX_RAW for FRC_STATUS                  */
#define _FRC_STATUS_FSMSTATE_TX_PAUSEFLUSH                 0x00000019UL                                      /**< Mode TX_PAUSEFLUSH for FRC_STATUS           */
#define FRC_STATUS_FSMSTATE_DEFAULT                        (_FRC_STATUS_FSMSTATE_DEFAULT << 20)              /**< Shifted mode DEFAULT for FRC_STATUS         */
#define FRC_STATUS_FSMSTATE_IDLE                           (_FRC_STATUS_FSMSTATE_IDLE << 20)                 /**< Shifted mode IDLE for FRC_STATUS            */
#define FRC_STATUS_FSMSTATE_RX_INIT                        (_FRC_STATUS_FSMSTATE_RX_INIT << 20)              /**< Shifted mode RX_INIT for FRC_STATUS         */
#define FRC_STATUS_FSMSTATE_RX_DATA                        (_FRC_STATUS_FSMSTATE_RX_DATA << 20)              /**< Shifted mode RX_DATA for FRC_STATUS         */
#define FRC_STATUS_FSMSTATE_RX_CRC                         (_FRC_STATUS_FSMSTATE_RX_CRC << 20)               /**< Shifted mode RX_CRC for FRC_STATUS          */
#define FRC_STATUS_FSMSTATE_RX_FCD_UPDATE                  (_FRC_STATUS_FSMSTATE_RX_FCD_UPDATE << 20)        /**< Shifted mode RX_FCD_UPDATE for FRC_STATUS   */
#define FRC_STATUS_FSMSTATE_RX_DISCARD                     (_FRC_STATUS_FSMSTATE_RX_DISCARD << 20)           /**< Shifted mode RX_DISCARD for FRC_STATUS      */
#define FRC_STATUS_FSMSTATE_RX_TRAIL                       (_FRC_STATUS_FSMSTATE_RX_TRAIL << 20)             /**< Shifted mode RX_TRAIL for FRC_STATUS        */
#define FRC_STATUS_FSMSTATE_RX_DONE                        (_FRC_STATUS_FSMSTATE_RX_DONE << 20)              /**< Shifted mode RX_DONE for FRC_STATUS         */
#define FRC_STATUS_FSMSTATE_RX_PAUSE_INIT                  (_FRC_STATUS_FSMSTATE_RX_PAUSE_INIT << 20)        /**< Shifted mode RX_PAUSE_INIT for FRC_STATUS   */
#define FRC_STATUS_FSMSTATE_RX_PAUSED                      (_FRC_STATUS_FSMSTATE_RX_PAUSED << 20)            /**< Shifted mode RX_PAUSED for FRC_STATUS       */
#define FRC_STATUS_FSMSTATE_UNDEFINED1                     (_FRC_STATUS_FSMSTATE_UNDEFINED1 << 20)           /**< Shifted mode UNDEFINED1 for FRC_STATUS      */
#define FRC_STATUS_FSMSTATE_UNDEFINED2                     (_FRC_STATUS_FSMSTATE_UNDEFINED2 << 20)           /**< Shifted mode UNDEFINED2 for FRC_STATUS      */
#define FRC_STATUS_FSMSTATE_RX_CRC_ZEROCHECK               (_FRC_STATUS_FSMSTATE_RX_CRC_ZEROCHECK << 20)     /**< Shifted mode RX_CRC_ZEROCHECK for FRC_STATUS*/
#define FRC_STATUS_FSMSTATE_RX_SUP                         (_FRC_STATUS_FSMSTATE_RX_SUP << 20)               /**< Shifted mode RX_SUP for FRC_STATUS          */
#define FRC_STATUS_FSMSTATE_RX_WAITEOF                     (_FRC_STATUS_FSMSTATE_RX_WAITEOF << 20)           /**< Shifted mode RX_WAITEOF for FRC_STATUS      */
#define FRC_STATUS_FSMSTATE_UNDEFINED3                     (_FRC_STATUS_FSMSTATE_UNDEFINED3 << 20)           /**< Shifted mode UNDEFINED3 for FRC_STATUS      */
