SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_frc.h
/* Bit fields for FRC CTRL */
#define _FRC_CTRL_RESETVALUE                               0x03000700UL                                    /**< Default value for FRC_CTRL                  */
#define _FRC_CTRL_MASK                                     0x071F7FF7UL                                    /**< Mask for FRC_CTRL                           */
#define FRC_CTRL_RANDOMTX                                  (0x1UL << 0)                                    /**< Random TX Mode                              */
#define _FRC_CTRL_RANDOMTX_SHIFT                           0                                               /**< Shift value for FRC_RANDOMTX                */
#define _FRC_CTRL_RANDOMTX_MASK                            0x1UL                                           /**< Bit mask for FRC_RANDOMTX                   */
#define _FRC_CTRL_RANDOMTX_DEFAULT                         0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_RANDOMTX_DEFAULT                          (_FRC_CTRL_RANDOMTX_DEFAULT << 0)               /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_UARTMODE                                  (0x1UL << 1)                                    /**< Data Uart Mode                              */
#define _FRC_CTRL_UARTMODE_SHIFT                           1                                               /**< Shift value for FRC_UARTMODE                */
#define _FRC_CTRL_UARTMODE_MASK                            0x2UL                                           /**< Bit mask for FRC_UARTMODE                   */
#define _FRC_CTRL_UARTMODE_DEFAULT                         0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_UARTMODE_DEFAULT                          (_FRC_CTRL_UARTMODE_DEFAULT << 1)               /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_BITORDER                                  (0x1UL << 2)                                    /**< Data Bit Order.                             */
#define _FRC_CTRL_BITORDER_SHIFT                           2                                               /**< Shift value for FRC_BITORDER                */
#define _FRC_CTRL_BITORDER_MASK                            0x4UL                                           /**< Bit mask for FRC_BITORDER                   */
#define _FRC_CTRL_BITORDER_DEFAULT                         0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define _FRC_CTRL_BITORDER_LSBFIRST                        0x00000000UL                                    /**< Mode LSBFIRST for FRC_CTRL                  */
#define _FRC_CTRL_BITORDER_MSBFIRST                        0x00000001UL                                    /**< Mode MSBFIRST for FRC_CTRL                  */
#define FRC_CTRL_BITORDER_DEFAULT                          (_FRC_CTRL_BITORDER_DEFAULT << 2)               /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_BITORDER_LSBFIRST                         (_FRC_CTRL_BITORDER_LSBFIRST << 2)              /**< Shifted mode LSBFIRST for FRC_CTRL          */
#define FRC_CTRL_BITORDER_MSBFIRST                         (_FRC_CTRL_BITORDER_MSBFIRST << 2)              /**< Shifted mode MSBFIRST for FRC_CTRL          */
#define _FRC_CTRL_TXFCDMODE_SHIFT                          4                                               /**< Shift value for FRC_TXFCDMODE               */
#define _FRC_CTRL_TXFCDMODE_MASK                           0x30UL                                          /**< Bit mask for FRC_TXFCDMODE                  */
#define _FRC_CTRL_TXFCDMODE_DEFAULT                        0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define _FRC_CTRL_TXFCDMODE_FCDMODE0                       0x00000000UL                                    /**< Mode FCDMODE0 for FRC_CTRL                  */
#define _FRC_CTRL_TXFCDMODE_FCDMODE1                       0x00000001UL                                    /**< Mode FCDMODE1 for FRC_CTRL                  */
#define _FRC_CTRL_TXFCDMODE_FCDMODE2                       0x00000002UL                                    /**< Mode FCDMODE2 for FRC_CTRL                  */
#define _FRC_CTRL_TXFCDMODE_FCDMODE3                       0x00000003UL                                    /**< Mode FCDMODE3 for FRC_CTRL                  */
#define FRC_CTRL_TXFCDMODE_DEFAULT                         (_FRC_CTRL_TXFCDMODE_DEFAULT << 4)              /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_TXFCDMODE_FCDMODE0                        (_FRC_CTRL_TXFCDMODE_FCDMODE0 << 4)             /**< Shifted mode FCDMODE0 for FRC_CTRL          */
#define FRC_CTRL_TXFCDMODE_FCDMODE1                        (_FRC_CTRL_TXFCDMODE_FCDMODE1 << 4)             /**< Shifted mode FCDMODE1 for FRC_CTRL          */
#define FRC_CTRL_TXFCDMODE_FCDMODE2                        (_FRC_CTRL_TXFCDMODE_FCDMODE2 << 4)             /**< Shifted mode FCDMODE2 for FRC_CTRL          */
#define FRC_CTRL_TXFCDMODE_FCDMODE3                        (_FRC_CTRL_TXFCDMODE_FCDMODE3 << 4)             /**< Shifted mode FCDMODE3 for FRC_CTRL          */
#define _FRC_CTRL_RXFCDMODE_SHIFT                          6                                               /**< Shift value for FRC_RXFCDMODE               */
#define _FRC_CTRL_RXFCDMODE_MASK                           0xC0UL                                          /**< Bit mask for FRC_RXFCDMODE                  */
#define _FRC_CTRL_RXFCDMODE_DEFAULT                        0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define _FRC_CTRL_RXFCDMODE_FCDMODE0                       0x00000000UL                                    /**< Mode FCDMODE0 for FRC_CTRL                  */
#define _FRC_CTRL_RXFCDMODE_FCDMODE1                       0x00000001UL                                    /**< Mode FCDMODE1 for FRC_CTRL                  */
#define _FRC_CTRL_RXFCDMODE_FCDMODE2                       0x00000002UL                                    /**< Mode FCDMODE2 for FRC_CTRL                  */
#define _FRC_CTRL_RXFCDMODE_FCDMODE3                       0x00000003UL                                    /**< Mode FCDMODE3 for FRC_CTRL                  */
#define FRC_CTRL_RXFCDMODE_DEFAULT                         (_FRC_CTRL_RXFCDMODE_DEFAULT << 6)              /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_RXFCDMODE_FCDMODE0                        (_FRC_CTRL_RXFCDMODE_FCDMODE0 << 6)             /**< Shifted mode FCDMODE0 for FRC_CTRL          */
#define FRC_CTRL_RXFCDMODE_FCDMODE1                        (_FRC_CTRL_RXFCDMODE_FCDMODE1 << 6)             /**< Shifted mode FCDMODE1 for FRC_CTRL          */
#define FRC_CTRL_RXFCDMODE_FCDMODE2                        (_FRC_CTRL_RXFCDMODE_FCDMODE2 << 6)             /**< Shifted mode FCDMODE2 for FRC_CTRL          */
#define FRC_CTRL_RXFCDMODE_FCDMODE3                        (_FRC_CTRL_RXFCDMODE_FCDMODE3 << 6)             /**< Shifted mode FCDMODE3 for FRC_CTRL          */
#define _FRC_CTRL_BITSPERWORD_SHIFT                        8                                               /**< Shift value for FRC_BITSPERWORD             */
#define _FRC_CTRL_BITSPERWORD_MASK                         0x700UL                                         /**< Bit mask for FRC_BITSPERWORD                */
#define _FRC_CTRL_BITSPERWORD_DEFAULT                      0x00000007UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_BITSPERWORD_DEFAULT                       (_FRC_CTRL_BITSPERWORD_DEFAULT << 8)            /**< Shifted mode DEFAULT for FRC_CTRL           */
#define _FRC_CTRL_RATESELECT_SHIFT                         11                                              /**< Shift value for FRC_RATESELECT              */
#define _FRC_CTRL_RATESELECT_MASK                          0x1800UL                                        /**< Bit mask for FRC_RATESELECT                 */
#define _FRC_CTRL_RATESELECT_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_RATESELECT_DEFAULT                        (_FRC_CTRL_RATESELECT_DEFAULT << 11)            /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_TXPREFETCH                                (0x1UL << 13)                                   /**< Transmit prefetch data                      */
#define _FRC_CTRL_TXPREFETCH_SHIFT                         13                                              /**< Shift value for FRC_TXPREFETCH              */
#define _FRC_CTRL_TXPREFETCH_MASK                          0x2000UL                                        /**< Bit mask for FRC_TXPREFETCH                 */
#define _FRC_CTRL_TXPREFETCH_DEFAULT                       0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define _FRC_CTRL_TXPREFETCH_X0                            0x00000000UL                                    /**< Mode X0 for FRC_CTRL                        */
#define _FRC_CTRL_TXPREFETCH_X1                            0x00000001UL                                    /**< Mode X1 for FRC_CTRL                        */
#define FRC_CTRL_TXPREFETCH_DEFAULT                        (_FRC_CTRL_TXPREFETCH_DEFAULT << 13)            /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_TXPREFETCH_X0                             (_FRC_CTRL_TXPREFETCH_X0 << 13)                 /**< Shifted mode X0 for FRC_CTRL                */
#define FRC_CTRL_TXPREFETCH_X1                             (_FRC_CTRL_TXPREFETCH_X1 << 13)                 /**< Shifted mode X1 for FRC_CTRL                */
#define FRC_CTRL_TXFETCHBLOCKING                           (0x1UL << 14)                                   /**< Transmit fetch data blocking                */
#define _FRC_CTRL_TXFETCHBLOCKING_SHIFT                    14                                              /**< Shift value for FRC_TXFETCHBLOCKING         */
#define _FRC_CTRL_TXFETCHBLOCKING_MASK                     0x4000UL                                        /**< Bit mask for FRC_TXFETCHBLOCKING            */
#define _FRC_CTRL_TXFETCHBLOCKING_DEFAULT                  0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_TXFETCHBLOCKING_DEFAULT                   (_FRC_CTRL_TXFETCHBLOCKING_DEFAULT << 14)       /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_SEQHANDSHAKE                              (0x1UL << 16)                                   /**< Sequencer data handshake                    */
#define _FRC_CTRL_SEQHANDSHAKE_SHIFT                       16                                              /**< Shift value for FRC_SEQHANDSHAKE            */
#define _FRC_CTRL_SEQHANDSHAKE_MASK                        0x10000UL                                       /**< Bit mask for FRC_SEQHANDSHAKE               */
#define _FRC_CTRL_SEQHANDSHAKE_DEFAULT                     0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define _FRC_CTRL_SEQHANDSHAKE_X0                          0x00000000UL                                    /**< Mode X0 for FRC_CTRL                        */
#define _FRC_CTRL_SEQHANDSHAKE_X1                          0x00000001UL                                    /**< Mode X1 for FRC_CTRL                        */
#define FRC_CTRL_SEQHANDSHAKE_DEFAULT                      (_FRC_CTRL_SEQHANDSHAKE_DEFAULT << 16)          /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_SEQHANDSHAKE_X0                           (_FRC_CTRL_SEQHANDSHAKE_X0 << 16)               /**< Shifted mode X0 for FRC_CTRL                */
#define FRC_CTRL_SEQHANDSHAKE_X1                           (_FRC_CTRL_SEQHANDSHAKE_X1 << 16)               /**< Shifted mode X1 for FRC_CTRL                */
#define FRC_CTRL_PRBSTEST                                  (0x1UL << 17)                                   /**< Pseudo-Random Bit Sequence Testmode         */
#define _FRC_CTRL_PRBSTEST_SHIFT                           17                                              /**< Shift value for FRC_PRBSTEST                */
#define _FRC_CTRL_PRBSTEST_MASK                            0x20000UL                                       /**< Bit mask for FRC_PRBSTEST                   */
#define _FRC_CTRL_PRBSTEST_DEFAULT                         0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_PRBSTEST_DEFAULT                          (_FRC_CTRL_PRBSTEST_DEFAULT << 17)              /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_LPMODEDIS                                 (0x1UL << 18)                                   /**< Disable FRC low power                       */
#define _FRC_CTRL_LPMODEDIS_SHIFT                          18                                              /**< Shift value for FRC_LPMODEDIS               */
#define _FRC_CTRL_LPMODEDIS_MASK                           0x40000UL                                       /**< Bit mask for FRC_LPMODEDIS                  */
#define _FRC_CTRL_LPMODEDIS_DEFAULT                        0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_LPMODEDIS_DEFAULT                         (_FRC_CTRL_LPMODEDIS_DEFAULT << 18)             /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_WAITEOFEN                                 (0x1UL << 19)                                   /**< Enable STATE_TX_WAITEOF                     */
#define _FRC_CTRL_WAITEOFEN_SHIFT                          19                                              /**< Shift value for FRC_WAITEOFEN               */
#define _FRC_CTRL_WAITEOFEN_MASK                           0x80000UL                                       /**< Bit mask for FRC_WAITEOFEN                  */
#define _FRC_CTRL_WAITEOFEN_DEFAULT                        0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_WAITEOFEN_DEFAULT                         (_FRC_CTRL_WAITEOFEN_DEFAULT << 19)             /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_RXABORTIGNOREDIS                          (0x1UL << 20)                                   /**< Disable ignoring CMD_RXABORT                */
#define _FRC_CTRL_RXABORTIGNOREDIS_SHIFT                   20                                              /**< Shift value for FRC_RXABORTIGNOREDIS        */
#define _FRC_CTRL_RXABORTIGNOREDIS_MASK                    0x100000UL                                      /**< Bit mask for FRC_RXABORTIGNOREDIS           */
#define _FRC_CTRL_RXABORTIGNOREDIS_DEFAULT                 0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_RXABORTIGNOREDIS_DEFAULT                  (_FRC_CTRL_RXABORTIGNOREDIS_DEFAULT << 20)      /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_SKIPTXTRAILDATAWHITEN                     (0x1UL << 24)                                   /**< TX Trail Data Skip Whitening                */
#define _FRC_CTRL_SKIPTXTRAILDATAWHITEN_SHIFT              24                                              /**< Shift value for FRC_SKIPTXTRAILDATAWHITEN   */
#define _FRC_CTRL_SKIPTXTRAILDATAWHITEN_MASK               0x1000000UL                                     /**< Bit mask for FRC_SKIPTXTRAILDATAWHITEN      */
#define _FRC_CTRL_SKIPTXTRAILDATAWHITEN_DEFAULT            0x00000001UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_SKIPTXTRAILDATAWHITEN_DEFAULT             (_FRC_CTRL_SKIPTXTRAILDATAWHITEN_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_SKIPRXSUPSTATEWHITEN                      (0x1UL << 25)                                   /**< RX Supplemental Data Skip Whitening         */
#define _FRC_CTRL_SKIPRXSUPSTATEWHITEN_SHIFT               25                                              /**< Shift value for FRC_SKIPRXSUPSTATEWHITEN    */
#define _FRC_CTRL_SKIPRXSUPSTATEWHITEN_MASK                0x2000000UL                                     /**< Bit mask for FRC_SKIPRXSUPSTATEWHITEN       */
#define _FRC_CTRL_SKIPRXSUPSTATEWHITEN_DEFAULT             0x00000001UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_SKIPRXSUPSTATEWHITEN_DEFAULT              (_FRC_CTRL_SKIPRXSUPSTATEWHITEN_DEFAULT << 25)  /**< Shifted mode DEFAULT for FRC_CTRL           */
#define FRC_CTRL_HOLDTXTRAILDATAACTIVE                     (0x1UL << 26)                                   /**< Defeat bit to hold txtraildata active       */
#define _FRC_CTRL_HOLDTXTRAILDATAACTIVE_SHIFT              26                                              /**< Shift value for FRC_HOLDTXTRAILDATAACTIVE   */
#define _FRC_CTRL_HOLDTXTRAILDATAACTIVE_MASK               0x4000000UL                                     /**< Bit mask for FRC_HOLDTXTRAILDATAACTIVE      */
#define _FRC_CTRL_HOLDTXTRAILDATAACTIVE_DEFAULT            0x00000000UL                                    /**< Mode DEFAULT for FRC_CTRL                   */
#define FRC_CTRL_HOLDTXTRAILDATAACTIVE_DEFAULT             (_FRC_CTRL_HOLDTXTRAILDATAACTIVE_DEFAULT << 26) /**< Shifted mode DEFAULT for FRC_CTRL           */

